cool/tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/parcelInBox/constant/reactingCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactingCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

active          true;

InjectionModel  ManualInjection;

DragModel       SphereDrag;

DispersionModel none;

PatchInteractionModel StandardWallInteraction;

HeatTransferModel RanzMarshall;

CompositionModel SingleMixtureFraction;

PhaseChangeModel LiquidEvaporation;

DevolatilisationModel none;

SurfaceReactionModel none;

PostProcessingModel none;

radiation       off;

coupled         false;

cellValueSourceCorrection off;

parcelTypeId    1;

constantProperties
{
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 1e-15;
    TMin            TMin [ 0 0 0 1 0 ] 200;
    pMin            pMin [ 1 -1 2 0 0 ] 1000;
    rho0            rho0 [ 1 -3 0 0 0 ] 1000;
    minParticleMass minParticleMass [ 1 0 0 0 0 ] 1e-15;
    T0              T0 [ 0 0 0 1 0 ] 350;
    cp0             cp0 [ 0 2 -2 -1 0 ] 4100;
    epsilon0        epsilon0 [ 0 0 0 0 0 ] 1;
    f0              f0 [ 0 0 0 0 0 ] 0.5;
    Tvap            Tvap [ 0 0 0 1 0 ] 284;
    Tbp             Tbp [ 0 0 0 1 0 ] 373;
    Pr              Pr [ 0 0 0 0 0 ] 0.7;
    LDevol          LDevol [ 0 0 0 0 0 ] 0;
    hRetentionCoeff hRetentionCoeff [ 0 0 0 0 0 ] 1;
    constantVolume  false;
}

interpolationSchemes
{
    rho             cell;
    U               cellPointFace;
    mu              cell;
    T               cell;
    Cp              cell;
    p               cell;
}

integrationSchemes
{
    U               Euler;
    T               Euler;
}

particleForces
{
    gravity         on;
    virtualMass     off;
    Cvm             0.5;
    pressureGradient off;
    gradU           gradU;
}

ManualInjectionCoeffs
{
    massTotal       massTotal [ 1 0 0 0 0 ] 5.23599e-10; // 1 droplet of density 1000 kg/m3
    parcelBasisType mass;
    SOI             0;
    positionsFile   "reactingCloud1Positions";
    U0              (0 0 0);
    parcelPDF
    {
        pdfType         uniform;
        uniformPDF
        {
            minValue        100e-06;
            maxValue        100e-06;
        }
    }
}
StandardWallInteractionCoeffs
{
    type            rebound;
}

RanzMarshallCoeffs
{
    BirdCorrection  off;
}

SingleMixtureFractionCoeffs
{
    phases
    (
        gas
        {
        }
        liquid
        {
            H2O 1;
        }
        solid
        {
        }
    );
    YGasTot0        0;
    YLiquidTot0     1;
    YSolidTot0      0;
}

LiquidEvaporationCoeffs
{
    enthalpyTransfer enthalpyDifference; // latentHeat;

    activeLiquids
    (
        H2O
    );
}

PatchPostProcessingCoeffs
{
    maxStoredParcels 100;

    patches
    (
        outlet
    );
}

// ************************************************************************* //
